[
  {
    "date": "2024-07-09 16:32:29",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Our sales director Bill Bai shared about the importance of maintaining a healthy liquidity at @ExpoBlockchain ! \n\nIt was a pleasure meeting such an engaged audience and sharing our insights onstage. We're thrilled to share that we had a fantastic evening networking cruise event on Saturday, co-hosted with @LBank_Exchange : Crypto Wave Rave!\n\nHuge shoutout to the organizers, as well as, everyone that we had the opportunity to connect with, including our Crypto Wave Rave event attendees. We would love to connect if you didn't manage to catch us over the last week, simply PM us or fill in this form: https://t.co/B9r0u6BPqf"
  },
  {
    "date": "2024-07-09 15:20:55",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Excited to share that @ssv_network has reached  #1mDVT! 🎉\n\nWe are glad to be part of DVT by supporting SSV."
  },
  {
    "date": "2024-07-08 15:54:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "MPC essentially gives multiple parties the ability to evaluate a computation without ever revealing private data. \n\nIt also reduces risk through having the private key split amongst multiple parties, reducing compromise of the key at a single point.\n\nRead more to find out how MPC wallets keep your assets safe:\nhttps://t.co/fdvNnIetfd"
  },
  {
    "date": "2024-07-05 12:23:57",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "First day down at @ExpoBlockchain Istanbul! Did you manage to catch us? Connect us with us at booth C74-C75 from today to Sunday!  \n\nIf not, join us at our exclusive cruise event on 6th July and navigate the future of #digitalassets alongside industry experts at our exclusive Crypto Wave Rave!  \n\nEvent Details\nDate: July 6th \nTime: 7pm - 10pm \nLocation: Eminönü Port, Istanbul \nOrganizers: ChainUp \u0026 @LBank_Exchange  \nRegistration Link: https://t.co/mK9eiumwra"
  },
  {
    "date": "2024-07-04 11:07:25",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Connect with us if you are in Istanbul for @ExpoBlockchain , at booth C74-C75 from today to Sunday. However, if you are not able to join the Blockchain Expo World event, you HAVE to join our cruise event! \n\nNavigate the future of #digitalassets alongside industry experts at our exclusive Crypto Wave Rave. Forge connections with esteemed practitioners, investors, and thought leaders while enjoying breathtaking #Istanbul views.  \n\nEvent Details\nDate: July 6th \nTime: 7pm - 10pm \nLocation: Eminönü Port, Istanbul \nOrganizers: ChainUp \u0026 LBank \nRegistration Link: https://t.co/mK9eiumwra \n\nSLOTS ARE LIMTED SO REGISTER NOW!"
  },
  {
    "date": "2024-07-01 17:28:34",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Set sail for the future of crypto! Join us on July 6th for our exclusive evening cruise event, co-hosted by ChainUp and @LBank_Exchange !\n\nNavigate the future of #DigitalAssets alongside industry experts at our exclusive Crypto Wave Rave. Forge connections with esteemed practitioners, investors, and thought leaders while enjoying breathtaking #Istanbul views.\n\nEvent Details:\nDate: July 6th\nTime: 7pm - 10pm\nLocation: Eminönü Port, Istanbul\nOrganizers: ChainUp \u0026 Lbank\nRegistration Link: https://t.co/mK9eiumwra\n\nSpace is limited, the future of crypto awaits. So register NOW!"
  },
  {
    "date": "2024-06-28 16:12:53",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are thrilled to be participating in @ExpoBlockchain  , in Türkiye this week!\n\nBlockchain Expo World, which will take place between 4-7 July, is TÜRKİYE’s first state-approved blockchain fair.\n\nWe would love to connect if you are there as well! Simply fill in your contact information here: https://t.co/6xLDcuFSqk"
  },
  {
    "date": "2024-06-25 17:00:19",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Watch as our expert panelists explain what exactly is tokenization in our RWA Tokenization series 1. \n\nFollow us to learn more about tokenization through our snippets from our tokenization webinar. https://t.co/uYaX7LzGHh"
  },
  {
    "date": "2024-06-21 11:00:11",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are at @iFXEXPO Cyprus Now! We would love to connect with you if you are at the event.  \n\niFX EXPO International Cyprus 2024 brings together C-level executives, fintech innovators and affiliates from the world’s top brands.  \n\nConnect with us to learn how ChainUp solutions will help you to exceed your #business goals. Leave us your contact information so that we can connect with you right away: https://t.co/esV7MdNW8f"
  },
  {
    "date": "2024-06-19 17:18:19",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "So why exactly asset #tokenization better than our current financial system?\n\nThrough asset tokenization, fund raising becomes much easier with increased liquidity, fractional ownership, faster transactions, enhanced security and transparency. \n\nFollow us to learn more about how Blockchain technology can empower your business."
  },
  {
    "date": "2024-06-14 13:42:26",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Did you manage to catch us at @Lagos Blockchain Week, in Nigeria this week?\n\nWe really enjoyed the opportunity to attend exciting and inspiration presentations, learn about latest #blockchain development in Nigeria and also connect with industry leaders \u0026 experts.\n\nThe event lasts 2 more days! Connect with us if you have not: https://t.co/ZrF8y65HM5"
  },
  {
    "date": "2024-06-12 11:12:14",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are going to be at @iFXEXPO International next week! IFX EXPO International is happening in #Cyprus from 18-20 June 2024.\n\nTrusted by thousands of brands, iFX EXPO is the leading conference connecting high-level executives in finance, financial services, and fintech from around the world. \n\nWe would love to connect if you are there as well! Find us at booth no. 93 or simply fill in your contact information here: https://t.co/RyXtnUFrpQ"
  },
  {
    "date": "2024-06-11 16:59:18",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "\"#Blockchain isn't just a revolutionary technology; it's a paradigm shift. We should perceive it not just as a future possibility, but as the essential #infrastructure for building a more efficient and secure tomorrow.\" said our COO at Consensus 2024.\n\nOur team learnt so much during the event and was deeply inspired by the #innovative potential showcased by companies during Consensus 2024. \n\nQuick shoutout to @CoinDesk and all attendees! If you missed us during the event, do drop us a message, we would love to connect with you."
  },
  {
    "date": "2024-06-11 12:09:38",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "“I don’t think people appreciate how ridiculous this is,” Nathan Geraci said. “Especially for a product that I was told nobody wanted. Now a $60 billion ETF category. In 5 months.”\n\nGlobal digital assets investment products net inflows  totaled to $2 billion USD.\n\n*Graph and information source from @TheBlock__ :\nhttps://t.co/C0NHGqqKvG"
  },
  {
    "date": "2024-06-10 14:23:46",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are thrilled to be participating in  @LagosBlockWeek , in Nigeria this week!\n\nLagos Blockchain Week features cutting-edge presentations delivered by thought leaders \u0026 experts from all protocols, aiming to chart a new course and foster relationships for a thriving #Blockchain ecosystem. \n\nWe would love to connect with you if you are there: https://t.co/eL0b6etCiy"
  },
  {
    "date": "2024-06-04 11:48:46",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Fundraising will never be the same with #RWA tokenization. Imagine being able to access and #invest in a valuable property, commodity or other previously illiquid asset, simply on an app.\n\n#tokenization brings increased accessibility, higher liquidity and transparency, opening up different dimensions to investing in assets. An example would be the ability to invest in #fractionalized real estate, where you previously had to purchase the whole property, locking up cash for a period of time.\n\nRead more to find out more about tokenization in real estate #investments:\nhttps://t.co/BM0pBRG7q7"
  },
  {
    "date": "2024-05-31 17:30:50",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Perhaps only #blockchain and #web3‌‌  community knows the distinct features, but there is a world of difference between Web3 and Web3.0.\n\nAccording to official definitions, Web3 refers decentralized web- based on blockchain technology and its numerous applications such as #tokenization.\n\nWhile Web3.0 is a semantic web that is more intelligent and connected.\n\nRead more to find out more about the exact differences between these two concepts: https://t.co/pwGFWiRNyp"
  },
  {
    "date": "2024-05-31 12:26:35",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "While some of our representatives are in Austin, Texas for #Consensus2024, another one of our team was in Kuala Lumpur, Malaysia for @PIKOMICT , The National Tech Association of Malaysia's CIO Conference 2024.\n\nThis year's theme \"Empowering Tomorrow through AI Today,\" deep dived into the transformative power of #AI and its impact on shaping the future.\n\nShoutout to organizers and attendees that we met during the event!\n\n#PIKOMCIO2024 #AI #Innovation #BlockchainAI"
  },
  {
    "date": "2024-05-30 17:54:47",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Since #BitcoinETFs started trading on 11th Jan 2024, with $12.1 billion going into a ETFs combined, breaking records for inflows within such short duration of time.\n\n$ETH ETFs approval appears to be just around the corner, will the various #Ethereum ETFs perform as well as the previous round?\n\nJoin us as we take you through the history of ETFs to see how you can maximize your portfolio with ETF investments:\nhttps://t.co/sp4JWBNe47"
  },
  {
    "date": "2024-05-30 15:57:08",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are just done with @consensus2024  day 1, did you manage to catch our COO's sharing on our core solutions?\n\nWe would love to connect with you, if you are around town 😃 \n\nFill in your contact information here so that our representatives can reach out to you: https://t.co/3zx0TzXSGI"
  },
  {
    "date": "2024-05-29 20:51:09",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Join us for a networking lunch at @consensus2024 side event together with @InfiblueNFT @Beosin_com @MetaStoneGroup @okxweb3 !"
  },
  {
    "date": "2024-05-29 17:41:23",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "The basis of #tokenization is to represent other #digitalassets as well as, non digital assets on-chain, in an immutable ledger system.\n\nOther than illiquid assets, #blockchain technology is also capable of tokenizing letter-of-credits and other documentation. The purpose of this is to create a system of documentation that is easily trackable and transparent to users, significantly reducing the process of paper documentation in industries such as international #trade and #commerce. \n\nRead how the blockchain technology can potentially revolutionize trade finance:\nhttps://t.co/zluIgnfGR0"
  },
  {
    "date": "2024-05-29 12:30:01",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Here are all the events that we will going for during #Consensus2024 by @CoinDesk \n\nIf you are there at any of the event, we would love to connect with you! Fill in your contact information for a quick chat with our solution experts 😁:\n\nhttps://t.co/Pdxr6J1esF https://t.co/CxR0ZcvVxk"
  },
  {
    "date": "2024-05-29 11:02:08",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "ChainUp agrees to the rules outlined in the Operating Rules of the Simple DVT Module for @LidoFinance x @SSV_network Node Operators in the Flirtatious Flamingo cluster as seen by my verified signature: https://t.co/y1yCuw8lcr"
  },
  {
    "date": "2024-05-28 17:37:30",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are attending 2 more events during Consensus!\n\nEvent 1: Consensus Founders \u0026 Investors brunch\nDate: Wednesday, May 29th, 11:00 AM - 2:00 PM CDT\nSign up link: https://t.co/r8nK2V7rGa\n\nEvent 2: Building Bridges: Uniting Innovators in the Metaverse by @InfiblueNFT \nDate: Friday, May 31st, 1:00 PM - 4:00 PM CDT\nSign up link: https://t.co/nazqptSFw6\n\nJoin us now and be part of an exclusive guest list featuring leading #web3‌‌ industry professionals, investors, and innovative founders!\n\n@caladanxyz @Hashlock_  @fractional @okx  @Beosin_com  @MetaStoneGroup @InfiblueNFT"
  },
  {
    "date": "2024-05-28 15:36:25",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are excited to announce our partnership with @BSquaredNetwork!\n\n@BSquaredNetwork  is the first Bitcoin Rollup based on zero-knowledge proof verification commitment, while also offering a DA Layer solution for other Bitcoin rollups.\n\nThis partnership represents our commitment to safeguard and support #blockchain innovations by providing compliant and secure Custody solutions."
  },
  {
    "date": "2024-05-28 09:53:45",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Last week our MENA representatives had the opportunity to attend @HQmena 's Crypto expo Dubai. \n\nIt was a fantastic event with top-notch investors and leaders in the #digitalassets and #blockchain industry to network and discover new business possibilities.\n\nHuge shoutout to the organizers and attendees, we had the greatest honor of attending the event and meeting you. If you missed us at the event, we would still love to connect with you: https://t.co/B9r0u6BPqf"
  },
  {
    "date": "2024-05-27 16:43:59",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are going to @CoinDesk 's @consensus2024 !\n\nConsensus, one of the world’s largest and most influential B2B conference that brings together all sides of the digital assets, blockchain and Web3 community.\n\nWe look forward to connecting with the brightest industry leaders, learning about the future of #digitalassets and meeting the brightest minds of the #web3‌‌  and #blockchain communities. \n\nConnect with us if you are there in Austin, Texas this Wednesday to Friday, connect with us by filling up your contact information:\nhttps://t.co/3zx0TzXSGI"
  },
  {
    "date": "2024-05-27 12:03:35",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We will be joining @consensus2024 by @CoinDesk 's after party: Consensus After Hours, on May 30th! \n\nOrganized by @bitbaselart and @MetisFest,  Consensus After Hours offers a refreshing and informal space to relax and unwind, as well as deepen your connections, gain new perspectives, and immerse yourself in the vibrant culture of the #blockchains community. \n\nConnect with us at the event: https://t.co/qJv7UVrXV8"
  },
  {
    "date": "2024-05-23 17:32:39",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Wallet-as-a-Service offers not only convenience, as well as enhanced security for institutions that are holding #digitalassets.\n\nBusinesses can gain access to a complete digital assets #financial solution provided by the Wallet-as-a-Service provider, including wallet development, maintenance, operations, and more. More importantly, regulated WaaS or #custody provider are also compliant, have a standard #security protocol, as well as Know-Your-Customer or Know-Your-Transaction services included in their services.\n\nRead more to find out why #WaaS solutions will benefit your business:\nhttps://t.co/YEpivAYmeh"
  },
  {
    "date": "2024-05-23 11:24:49",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Did you manage to speak to us at @RegulationAsia 's Fraud \u0026 Financial Crime Asia 2024 Event on Tuesday?\n\nWe had a fantastic time connecting industry leaders in #FinancialSecurity and crime prevention. We also learned a ton about the latest trends, around the latest technology for #AML and #KYC. We also showcased our product to a great audience and connected with many attendees. \n\nIf you missed us at the event definitely connect with one of our friendly representatives or PM us."
  },
  {
    "date": "2024-05-20 17:22:59",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "True value of #NFT is to clearly define ownership and value, especially in the metaverse. \n\nOwnership of #digitalassets becomes verifiable and secure, empowering users to truly own their belongings, even in the virtual world.\n\nRead more to find out how #blockchain technology and NFTs are shaping the metaverse:\nhttps://t.co/kOWbHzHZrh"
  },
  {
    "date": "2024-05-20 12:34:57",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "ChainUp is going to @CoinDesk 's @consensus2024 !\n\nWe are really excited to be part of one of the world’s largest and most influential B2B conference that brings together all sides of the digital assets, blockchain and #web3‌‌ community.\n\nLooking forward to connecting with the brightest industry leaders, learning about the future of #digitalassets and meeting the brightest minds of the #web3‌‌  and #blockchain communities. \n\nIf you are there in Austin, Texas as well on May 29-31 , connect with us by filling up your contact information:\nhttps://t.co/B9r0u6BPqf"
  },
  {
    "date": "2024-05-17 13:55:36",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "ChainUp will be at @HQmena 's Crypto Expo Dubai, on the 20th-21st of May at Dubai World Trade Centre!\n\nJoin us and network with the best #digitalassets businesses for trading \u0026 investing, and learn about the cryptocurrency industry, Altcoins, Blockchain, and Consensus.\n\nSee you there at the event! Connect with us if you are there:\nhttps://t.co/NFrh7wkKv2"
  },
  {
    "date": "2024-05-15 16:35:07",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "ChainUp will be at @RegulationAsia 's Fraud \u0026 Financial Crime Asia 2024! This event will take place on 21 May at Fairmont Singapore \u0026 Swissôtel The Stamford.\n\nNetwork with industry leaders in fraud and #financial crime prevention from Asia’s largest banks, #payments firms, asset managers as well as the region’s leading regulatory bodies and market participants.\n\nIf you are there at the event as well, we would love to connect with you:\nhttps://t.co/kcH8vZbhVK"
  },
  {
    "date": "2024-05-14 17:28:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "ChainUp is partnering @vntrcapital to discuss the latest trends and investment opportunities at a roundtable event, during Echelon X in Singapore.\n\nEnjoy networking with fellow investment decision-makers, get acquainted through roundtable discussions \u0026 private chats and learn about new investment trends and opportunities\n\nSign up for the event now: https://t.co/oOJTcacMkb"
  },
  {
    "date": "2024-05-13 16:37:19",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Whether you are trading or running a centralized or decentralized exchange, liquidity is one of the key features that you would want to take note of.\n\nHaving enough liquidity in the platform determines whether the trader will enjoy lower slippage, faster trade execution and reduced trading cost, which are extremely crucial especially when your order size is big. \n\nRead this article to understand how Liquidity-as-a-Service helps traders to maximize their #Trading experience:\nhttps://t.co/dd8LfXbZvv"
  },
  {
    "date": "2024-05-07 16:09:10",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#Assettokenization is shaking up the financial system, and it's not just about #Crypto anymore.\n\nDate: 9th May, Thursday \nTime: 4PM-5PM (GMT+8)\nRegistration link: https://t.co/zsAG8kefY0\n\nJoin our webinar and discover:\n- Demystifying asset tokenization: Learn how real-world assets are converted into digital tokens, and unlock the advantages over traditional investment methods.\n\n- The power of blockchain: Discover how blockchain technology empowers faster, more transparent, and potentially more liquid investment opportunities.\n\n- The impact goes beyond crypto: Explore how asset tokenization has the potential to reshape traditional finance as well.\n\nDon't miss your chance to be a part of the investment revolution. Register for the webinar now."
  },
  {
    "date": "2024-05-02 15:55:49",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "This is a historic launch of #Bitcoin and #Ethereum ETFs in Hong Kong!\n\nFronted by China Asset Management (Hong Kong), Harvest Global Investments Limited, and Bosera Asset Management (International) Co., ChainUp joined as a cornerstone investor upon the ETFs launch, highlighting a new chapter of digital asset financing.\n\nChainUp remains committed to fostering a #secure and #compliant environment for institutional digital asset adoption. We look forward to witnessing the positive impact of this collaboration and the continued growth of the Hong Kong digital asset ecosystem.\n\n#HongKong #DigitalAssets #ETFs #Crypto #Web3\n\nRead more about the success of historically significant ETFs listing:\nhttps://t.co/4GZAMniL6N"
  },
  {
    "date": "2024-05-02 12:42:21",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Heard a lot about #tokenization , but still not sure how it works? This article breaks it down step by step for you.\n\n#tokenization , through #blockchain  technology, allows for faster and simpler fund raising process: through faster transaction, almost no settlement time and higher liquidity.\n\nRead more to find why tokenization will revolutionize the #fintech  industry:\nhttps://t.co/ZUlc1Ywpr4"
  },
  {
    "date": "2024-04-24 17:20:28",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Heaviest rainfall in 75 years turned brought life in Dubai to standstill last week, as @token2049 and other events were in place. \n\nShoutout to the #Web3Community in Dubai last week, hope you are all safe and sound.\n\nDespite the flood, halted traffic and cancelled flights, our team worked around the storm to make it to various events. Thank you everyone who made it to our very successful networking event: Web3 at Burj Khalifa. \n\nIf you didn't catch us at the various event, we would love to connect with you: https://t.co/KLXbd45WDX"
  },
  {
    "date": "2024-04-24 15:16:41",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Know-Your-Transaction (KYT), the equivalent of Know-Your-Customer (KYC) in #digitalassets. \n\nWith the ability to identify suspicious transactions and red flag, maintaining constant vigilance of transactions in #decentralized market is much easier for institutions.\n\nRead this article to understand the power of #transaction monitoring:\nhttps://t.co/gehnGBnWul"
  },
  {
    "date": "2024-04-23 16:23:52",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "The future of #fund raising and #investing is already here! \n\n@BlackRock CEO Larry Fink said in a interview that #Bitcoin #ETFs  \"are just stepping stones towards tokenization and I really do believe this is where we're going to be going.\"\n\nJoin this webinar to find out why he said that and what #tokenization means for you and your organization!\n\nDate: 2nd May 2024\nTime: 4PM- 5PM\nRegistration link: https://t.co/zsAG8kefY0"
  },
  {
    "date": "2024-04-23 13:02:35",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "MPC wallets, hot wallet, cold wallet, joint custody- what is the difference between all these solutions?!\n\nThe underlying concept for holding #DigitalAssets  is rather simple. Your assets are recorded on the #blockchain and will be immutable. However, all these wallet solution holds the private keys to assess your digital assets.\n\nThis article explores the current state of digitalasset custody, highlighting the limitations of existing solutions and introducing a powerful innovation: Multi-Party Computation (MPC) wallets.\n\nRead more to find out how MPC technology empowers users with unparalleled control over their holdings, while maintaining robust security measures:\nhttps://t.co/4XzmxpbL1y"
  },
  {
    "date": "2024-04-19 18:52:08",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Dubai is back! Join us and embrace the sun and cool breeze at @token2049  \n\nChainUp is a global leading end-to-end #blockchain technology solutions provider covering infrastructure development and ecosystem support. If you need innovative and compliant solutions on SaaS #digitalassets exchange development KYT, NFT trading, wallet, liquidity, Web3.0 infrastructure, digital asset custody, RWA tokenization and more, come speak to us.\n\nOnly 4 hours more til the end of Token2049!"
  },
  {
    "date": "2024-04-19 11:20:20",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#BitcoinHalving2024 is occurring roughly today or tomorrow! But what does this mean for investors?\n\nLet's look at some numbers, \n#Bitcoin 's first halving - prices increase 95x \nsecond halving - price increase 30x\nthird halving - prices increase almost 8x \n\nEven though there is no guarantee that prices will increase this time as well, 70% of respondents in a survey done by @bitgetglobal plan to increase their #digitalassets investment, signaling a stronger willingness to invest.\n\nHowever, on the flip side, @DeutscheBank has said in a research report that halving has already priced in and there will not be a huge rally. \n\nRead our article to find out more bitcoin halving means for investors this time round:\nhttps://t.co/0fBsE747Tj"
  },
  {
    "date": "2024-04-18 17:16:20",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We're thrilled to be attending @token2049 , the leading global conference for the #digitalassets ecosystem! This is an incredible opportunity to connect with industry leaders, collaborate with builders and investors, and help shape the future of #blockchain technology.\n\nDefinitely connect with one of our solution experts, if you are there!"
  },
  {
    "date": "2024-04-18 10:44:12",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Important notice! Due to unforeseen circumstances with the previous venue, we were required to change the event venue to Armani/Privé at #BurjKhalifa \n\n​We understand this may cause some inconvenience, and we sincerely apologize for any disruption to your plans. Due to the weather, our confirmed venue booking at the beach was cancelled, but we are thrilled to announce a fantastic new location to unwind and connect after a productive day one at @token2049 .\n\n​The rescheduled event will take place at the same time:\n\n​Event name: ChainUp Web3 Dubai at Burj Khalifa\n​Date: Tomorrow, April 18th, 2024\n​Time: 8:00 PM to 11:00 PM (GMT+4)\n​Location: Armani/Privé at Burj Khalifa\nEvent link: https://t.co/7dBzujaN5a\n\n​Dress code: The dress code is smart elegant /Fashionable wear only\n\n​We look forward to seeing you tomorrow, at the illustrious Armani/Prive Club for our exclusive Afterparty!"
  },
  {
    "date": "2024-04-17 16:46:33",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Important notice: we are changing the event date to the 18th April 8PM, due to the weather conditions in Dubai. \n\nOriginally scheduled for 17th April, the event will now be held on 18th April at 8PM, starting at the same time. We understand this change may cause inconvenience, and we sincerely apologize for any disruption to your schedule. We hope that the weather and traffic conditions clear up enough for everyone to make it to our event tomorrow.\n\nDate: Thursday, April 18th\n​Time: 8:00 PM - 12:00 AM (GMT+4)\nLocation: Zero Gravity Dubai\nSign up link: https://t.co/7dBzujaN5a\n\nSee you tomorrow!"
  },
  {
    "date": "2024-04-17 11:00:46",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Historically, previous #BitcoinHalving  esulted in a substantial price increase and many believe that this coming halving will be the same as well. #Bitcoin \n\nHowever, 2024 started out with numerous events, such as the entry of traditional #Finance into the #Crypto  space, will the rules still hold the same?\n\nWhat exactly is halving and how will it impact prices? Read more in our beginner guide:\nhttps://t.co/x6udyx2cdd"
  },
  {
    "date": "2024-04-16 18:15:18",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Our beach networking event: WEB3 By The Bay is just tomorrow! Register here NOW: https://t.co/7dBzujaN5a\n\nJoin ChainUp and our co-host, @HouseLux_Dubai , for an exclusive evening of insightful conversation, discerning connections, exciting moments and delectable refreshments at the one of the best beach clubs in Dubai\n\nDate: Wednesday, April 17th\nTime: 8:00 PM - 12:00 AM (GMT+4)\nLocation: Event address will be provided upon ticket confirmation\n\nA big shoutout to our co-host, @HouseLux_Dubai for hosting this wonderful event with us. With a customer-first commitment, House Lux is a Dubai one-stop online real estate platform, with VR viewing features and USDT payment, for you to get the best housing deals. Available both on web and app, check out their website now: https://t.co/isTO1GjtxM\n\nJoin us today!"
  },
  {
    "date": "2024-04-15 16:33:37",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Next 3 of the 7 events, catch us at: @summit_web3_  Dubai, GLobal Blockchain Show @0xGBS , @Cointime_global  @Timestampsummit Dubai Investor Night\n\nAll 3 of these events gather industry leaders from the #Web3 ecosystem and projects, to share their most valuable insights and discuss future opportunities in the web3 and #blockchain space. \n\nDefinitely speak to us if you are the event!"
  },
  {
    "date": "2024-04-15 12:03:04",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#Bitcoin prices falls around 10% over the weekends, right before the week of halving. \n\nEven though the reason for the fall was not clear, this decline after news of Iran launching attacks on Israel. \n\n#BitcoinHalving2024 #cryptomarket #digitalasset \n\nhttps://t.co/By0VmA06CQ"
  },
  {
    "date": "2024-04-12 16:55:03",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Next of the 7 events: Join ChainUp for an exclusive evening of #insightful conversation, discerning connections and delectable refreshments at one of the best #beach clubs in town!\n\n​Date: Wednesday, April 17th\n​Time: 8:00 PM - 12:00 AM (GMT+4)\n​Location: The Surroundings of Palm Jumeirah\nRegister now: https://t.co/7dBzujaN5a\n\nDiscover the best #Web3  projects/ #investments - gain insights from thought leaders and fellow industry professionals.\n\n​Expand your network- connect with influential #blockchain / Web3/ Financial figures in Dubai and all over the world.\n\n​Embrace the future- explore cutting-edge strategies for navigating the ever-evolving investment landscape.\n\n​Limited Spots Available! RSVP by April 16th to Secure Your Place."
  },
  {
    "date": "2024-04-12 11:00:42",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Starting with the first of 7 events that we are attending in #Dubai: @BlLife_Forum\n\nThe highly anticipated #Blockchain Life Forum 2024 is set to take place in the vibrant city of Dubai on April 15-16. \n\nWelcoming industry leaders and #crypto experts from around the world, the central topic of the forum will be making money during the #BullRun .\n\nWe would love to connect with you, catch us at booth S35!\n\nSee you there!\n\nhttps://t.co/ax2Gvwy5GE"
  },
  {
    "date": "2024-04-08 16:17:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "When evaluating a #DigitalAssets fund or other type of investment vehicles, it is critical to take into account its regulatory #Compliance , on top of risk \u0026 returns.\n\nCompliant funds, not only reduce #investment risks, but also protects their investors' interest. \n\nRead more to find out the regulatory areas \u0026 operations, that you as an investor need to be mindful of:\nhttps://t.co/Z3SMbwv4MI"
  },
  {
    "date": "2024-04-07 12:17:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Are you at @festival_web3 Hong Kong? Join us at our evening cocktail event on 8th Apr! RSVP NOW https://t.co/AMCMBkNhwE\n\nEngage in stimulating discussions about the future of \n#Web3 Businesses, #DigitalAssets mining, asset management, RWA #Tokenization and forge valuable connections with industry leaders and experts.\n\nLocation: Zuma Hong Kong \nDate: 8th April 2024 \nTime: 7PM-10PM \nRegistration Link: https://t.co/AMCMBkNhwE"
  },
  {
    "date": "2024-04-05 13:40:28",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Significantly different from other asset classes, #digitalasset asset management can be unfriendly to investors looking make an entry. \n\nEven though the #asset class itself is highly volatile, it still exhibits higher risk-return ratio and the potential for earnings. However, without a deep understanding of the underlying #technology, chain utilities and tech ecosystem and many more analytical considerations, valuation can be tricky.\n\nRead more to find out how ChainUp #investment team can help you maximize your portfolio, in digital assets.\n\nhttps://t.co/kDiJtkMi6x"
  },
  {
    "date": "2024-04-04 18:17:31",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "If you are in Hong Kong for the @festival_web3 , join us at our evening cocktail event! \n\nEngage in stimulating discussions about the future of #Web3 Businesses, #DigitalAssets mining, asset management, RWA #tokenization and forge valuable connections with industry leaders and experts.\n\nLocation: Zuma Hong Kong \nDate: 8th April 2024 \nTime: 7PM-10PM \nRegistration Link: https://t.co/AMCMBkNhwE"
  },
  {
    "date": "2024-04-03 16:44:33",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "ChainUp is attending @festival_web3 Hong Kong this weekend! 🔥 \nWill you be in Hong Kong for the Web3 festival? If so, do come and speak to us at booth number G6.\n\nBringing together industry leaders from over the globe, HK Web3 Festival 2024 will feature an amazing lineup of the world’s brightest minds, top Web3 projects and leading venture capitals.\n\nSee you there! 😊\n\n@HashKeyGroup @WXblockchain"
  },
  {
    "date": "2024-04-03 11:57:55",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "3rd Apr BTC ETF Updates 🔥 \n1. #bitcoins slides after announcement of U.S. manufacturing activity picking up, lowering the probability for #rate cut in the short term.\n\n2. Around $400 million was liquidated with the slide in the past 24 hours, with $130 million coming from Bitcoin.\n\n3. Outflows are still continuing with @Grayscale (GBTC) selling off another $300 million. \n\n4. March trading volume stands at $111 billion, seemingly around 3 times of Feb.\n#BitcoinETF"
  },
  {
    "date": "2024-04-02 14:46:11",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Although #blockchain  s commonly said to be immutable, the truth is that it is not. \n\nHowever, it does take an enormous amount of effort to actually threaten the security of the data that is recorded on chain. Malicious attacks, more often not, are based off human error rather than system errors. \n\nRead more to find out the security #risks and how to mitigate these risks:\n\nhttps://t.co/mnojIuVmmd"
  },
  {
    "date": "2024-04-01 15:05:41",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Trading fees for the largest #DigitalAssets exchange, @binance , amounted to $324 million in the month of December 2023 alone.\n\n#trading fees are the bread and butter for exchanges. However, there are multiple features where exchanges can generate revenue.\n\nRead more to find out how a typical exchange can maximize revenue:\n\nhttps://t.co/xr9GIgYHZ7"
  },
  {
    "date": "2024-03-27 13:50:48",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are excited to share that ChainUp has achieved SOC 2 Type 2 compliance! This rigorous independent audit by @Deloitte validates the effectiveness of our controls for security, availability, processing integrity, confidentiality, and privacy.\n\nAt ChainUp, we take #data security incredibly seriously. This achievement demonstrates our unwavering commitment to protecting our clients' information and building trust.\n\nWant to learn more about SOC 2 compliance and what it means for you? Check out our blog post or reach out to our team!\n\nhttps://t.co/ZwnhpAJ0CN"
  },
  {
    "date": "2024-03-22 14:53:18",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#Web3 wallet allows you to connect and transfer your assets between hybrid exchanges and #decentralized  exchanges.\n\nBuilt for serious traders who diversifying their #trading  strategies on centralized exchange and decentralized exchange, web3 wallets seamlessly connects to both.\n\nRead up more on newest trend in #DigitalAssets trading: web3 wallet \u0026 hybrid exchanges.\n\nhttps://t.co/delLdcZDoi"
  },
  {
    "date": "2024-03-21 14:00:00",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "News has it that @SECgov may be investigating  @ethereum"
  },
  {
    "date": "2024-03-21 11:48:17",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#BlackRock announces RWA #tokenization fund on the #Ethereum network!"
  },
  {
    "date": "2024-03-20 17:55:36",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "While #BlockchainTechnology enables the vision of #DecentralizedFuture , regulations must be in place to protect the public from crime.\n\nRegulation implementation instils #trust and foster confidence for investors and general public to adopt this new technology.\n\nRead more about regulations in #Blockchain and how it impacts us today and in the future.\n\nRead more:\nhttps://t.co/6teHZeZDm1"
  },
  {
    "date": "2024-03-19 14:01:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Glad to be a node operator in the 'Xeric Xenolith' Cluster and 'Zealous Zebra' Cluster, running geth and lighthouse on the Simple DVT SSV module. \n\nLooking forward to mainnet!"
  },
  {
    "date": "2024-03-18 16:49:47",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "1 more day 🔥 Join us in our webinar as we dive into the potential of #Web3 innovation.\n\nThe webinar, convened by esteemed experts, aims to demystify key concepts like #decentralized finance (DeFi), other DeFi businesses, and explore their impact on the future of finance. #webinar #decentralized \n\nDate: TOMORROW 19th March 2024\nTime: 4pm-5pm (GMT+8)\nSign up link:  https://t.co/5Zno7bv9vb\n\nJoin us NOW!"
  },
  {
    "date": "2024-03-18 12:30:46",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Global #digitalassets wallet was valued at around $10 billion in 2023 and is forecasted to reach $48 billion in 2028. \n\nThe newest wallet innovation allows you to access both centralized and decentralized exchanges at the same time. Read more about #web3 wallets here.\n\nhttps://t.co/lUFRMzH4sf"
  },
  {
    "date": "2024-03-14 15:36:57",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Gas fees drop as #DencunUpgrade goes live on $ETH mainnet! EIP-4844 \n\nhttps://t.co/xMUrbtgZlq"
  },
  {
    "date": "2024-03-12 16:38:25",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "🚀 Excited to announce our upcoming webinar, hosted in partnership with Blockchain Association Singapore (BAS)\n\nJoin us to demystify Web3's core principles: user ownership and decentralization, explore the transformative potential of #DEFİ and DEXs, as well as emerging trends like Real-World Asset (RWA) #tokenization and Decentralized Society (DeSoc) applications.\n\nDate: 19th March 2024, Tuesday\nTime: 4PM-5PM (GMT +8)\nLocation: Online Zoom Webinar\nSign up link: https://t.co/5Zno7bv9vb\n\nDon't miss this opportunity to stay ahead of the curve! Register now. 💼💡"
  },
  {
    "date": "2024-03-12 12:08:23",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "12 March updates🔥\n\n1. #bitcoin went on to hit all time high of $72K before sliding back to $71K today\n2. BTC became the eighth largest #Asset  by market cap, surpassing silver\n3. Inflows from 9 pioneer BTC ETF exceed $20 billion, with BlackRock's IBIT leading the way at $10 billion.\n\n#BitcoinETF #BullishAF \n\nSource: \n\nhttps://t.co/DT5l4bcfp9\n\nhttps://t.co/3keAgqghsq"
  },
  {
    "date": "2024-03-11 16:41:37",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "11th March updates: #Bitcoin  hits new all time high price of $71K! 🔥\n\nBTC prices charts new high with 11.3% weekly gains. Around $44 million shorts positions are liquidated in the sudden pump. On the other hand, Ethereum hits $4k, gaining 14.5% for the day. #BullishAF  #AllTimeHigh  #BULLISH \n\nhttps://t.co/cXqYW4TYw5\n\nhttps://t.co/uRu0AsUvlh"
  },
  {
    "date": "2024-03-11 15:42:23",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Launching a #decentralized exchange is effort intensive, but at the same time, it is not complicated.\n\nRead our comprehensive guide to launching your own Decentralized Exchange\n\nhttps://t.co/AsM3dSQtkc https://t.co/h5RaLtzTIL"
  },
  {
    "date": "2024-03-08 16:57:14",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "2 more events: Taiwan and Vietnam!\nJoin us as we connect with Taiwanese and Vietnamese industry leaders, investors as well as #Web3Community members, and learn about the latest developments in their #Web3  industry.\n\nTaiwan event details:\n\nDate: 16th Mar 2024\nTime: 1.30PM-4.30PM (GMT+4)\nLocation: MaiCoin HQ Taipei, Taiwan\nSign up link: https://t.co/l57QwUE7JH\n\nVietnam event details:\n\nDate: 10th March 2024\nTime: 4PM-7PM (GMT+7)\nLocation: Hello World Saigon, Vietnam\nSign up link: https://t.co/4DKS3bfKcS"
  },
  {
    "date": "2024-03-07 17:04:57",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Recently, U.S. Government has become active, transferring nearly $1 billion worth of #Bitcoin  after seizing it 2 years ago.\n\nIn the infamous #Hacking incident almost 8 years ago, 120,000 Bitcoins were stolen from exchange Bitfinex. The incident caused a plunge in trading in Bitcoin by 20%. Recently, the Bitcoins that were seized after apprehending the culprits were recently moved again. #Criminal \n\nRead more to find out how we can use ChainUp's Know-Your-Transaction to track where the Bitcoin is going.\n\nhttps://t.co/cfSD7V1wwg"
  },
  {
    "date": "2024-03-05 16:50:26",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We had the privilege of attending Annual DBAC Business conference organized by SUSS DBAC, where our Head of Asset Management, Zhubing He, CFA, FRM shared her views \u0026 experiences on investing in a VUCA environment.\n\nWe also had the chance connected with industry leaders, gained valuable insights, and explored new opportunities. Huge shoutout to the organizers for having such a successful event!\n#Networking  #investments  #vuca"
  },
  {
    "date": "2024-03-05 12:00:13",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "🔥 5th March Headlines: we are all holding our breaths as $BTC bitcoin hits $68K USD, $1K more before breaking all time high! #BitcoinETFs  #BullishAF \n\n1. Bitcoin market cap has already hit #alltimehigh  since November 2021, at $1,303 trillion USD.\n2. According to @CoinSharesCo , global #DigitalAssets  investment producte saw a record treading volume of $30 billion just last week.\n3. Memecoins market cap has increased by over 17%, of which, #shibainucoin  $SHIB and #pepecoin  $PEPE increased by 327% and 284% respectively, over the last 7 days."
  },
  {
    "date": "2024-03-04 15:55:37",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "64K officially #Bullish https://t.co/mVb5H0HEux"
  },
  {
    "date": "2024-03-04 12:08:58",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "This past Saturday, our team had the fantastic opportunity to attend Blockchain Festival Asia organized by FINEXPO (@Finexpo_org ), and what an enriching experience it was! 💼 From #insightful keynotes to panel sessions, we were immersed in a world of learning and knowledge sharing.\n\nWe connected with industry leaders, exchanging ideas and immersed ourselves in the passion and dedication within the #blockchain community.\n\nA huge shoutout to the organizers for putting together such a remarkable event."
  },
  {
    "date": "2024-02-29 11:44:35",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#Bitcoin 64k?!\n\n#BitcoinETFs  break volume record as @BlackRock's IBIT pulls in fresh $520 million! As Bitcoin went to $61K yesterday, @MorganStanley was said to be in the midst of doing due diligence to add #BitcoinETF to its brokerage platforms.\n\n#BullishAF #ToTheMoon #HODL https://t.co/e0z6uP4qsz"
  },
  {
    "date": "2024-02-28 17:16:25",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Security Token Offerings (#STO) are often mistaken with Initial Coin Offerings (ICO), as they are conceptually similar.\n\nHowever, STOs are more #regulated than ICO, making it a more secure #investments option for institutional investors. STO also offers the option of listing #tokenized Real World Asset (#RWAs ).\n\nRead more to find out the differences between STO vs ICO:\n\nhttps://t.co/s99GXQsLOi"
  },
  {
    "date": "2024-02-27 11:54:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "27th Feb Update! 📈\n1. In yesterday's price pump, bitcoin grew around 10% to 56k in around 12 hours and is inching close to its all time high price since 3 years ago.\n\n2. Nine new spot #BitcoinETF also registered a combined $2.4billion in buying and selling activity. With BlackRock's IBIT leading the way, with $1.3 billion in #trading and ranked 11th amongst all ETFs\n\n3. However, analyst warns of headwinds to Bitcoin, under January hot U.S. inflation data\n\nRead more on @TheBlock__ : https://t.co/Icm8tGp3Fi"
  },
  {
    "date": "2024-02-26 16:16:24",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Tokenizing #assets making them easily tradeable, transferable and managed using #blockchains or distributed ledger technology, ensuring immutability and providing tamper-proof integrity.\n\nThe act of listing the tokenized assets for public trading, is then referred to as #Security Token Offering (STO).\n\nFind out more about Security Token Offering and the benefits that it provides to investors:\n\nhttps://t.co/ZnZAtDGnWs"
  },
  {
    "date": "2024-02-26 11:29:12",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We're excited to be at @AIBC_World's event: @AIBC Eurasia, in Dubai, alongside some of the brightest minds in the #GenAi  \u0026 #BlockchainTechnology sector! We're looking forward to learning from industry leaders, exploring the latest trends and showcasing our innovative solutions.\n\nIf you're attending, be sure to stop by our booth at No. 105B! We'd love to chat and connect with you. 🤗\n\nSee you there!"
  },
  {
    "date": "2024-02-23 16:08:17",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "2 more events: 1 in Dubai and 1 in Indonesia!\nJoin us as we connect with industry leaders, investors as well as #web3community members, and learn about the latest developments in the the #web3 industry.\n\nHere are the event details for Dubai in Luma link:\n\nDate: 28th Feb 2024\nTime: 6PM-9PM (GMT+4)\nLocation: The Offices 4, One Central, Dubai\nSign up link: https://t.co/c1V2ylNdtN\n\nHere are the event details for Indonesia in Luma link:\n\nDate: 1st March 2024\nTime: 6PM-9PM (GMT+7)\nLocation: Ruuang Kopi - Blok M\nSign up link: https://t.co/4sknFBzzos\n\n#BlockchainInnovation #cryptocurrency #CryptoCommunity"
  },
  {
    "date": "2024-02-22 16:36:25",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Choosing the #TOKEN standards for your #NFT project can be tricky!\n\nToken standards are a set of rules that governs how digital tokens should behave and interact within a specific blockchain ecosystem.\n\nRead more on our article we details the pros and cons of the different protocols for your NFT project:\nhttps://t.co/xdNkgMPR8G\n\n#NFTcollections  #DigitalAssets  #nftart  #BlockchainInnovation #Blockchain"
  },
  {
    "date": "2024-02-22 11:19:38",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are having first of the many #Web3 events globally, starting with Türkiye!\n\nJoin us as we connect with industry leaders, investors as well as #web3community members, and learn about the latest developments in the the industry.\n\nCheck out the event details in the Luma link below now!\n\nDate: 25th Feb 2024\nTime: 1PM-5PM \nLocation: Istanbul\nSign up link: https://t.co/4Dx8J8rXtv"
  },
  {
    "date": "2024-02-21 15:49:20",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "21st update: #Ethereum  price hit $3K yesterday for the first time in 2 years, dips then shortly returned to $3k as of today.\n\nProspects of a possible #EthereumETF  , combined with inflows from #BitcoinETF , has pushed prices up. In other news, #Bitcoin also hit yearly high of $52,908.\n\nHowever, analysts points out that Ether put options are clustering at $2,200.\n\nBearish indicator or Hedging strategy?\n\n#BullishAF \nRead more on The Block:\nhttps://t.co/sDwKYRhkt5"
  },
  {
    "date": "2024-02-20 18:54:08",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We're thrilled to co-host the TimeStamp Denver Developer Night in Denver on Feb 27th with  @ABCDELabs   @HailstoneLabs   @SinohopeGroup   and of course,  @Cointime_global ! \nJoin us in Denver next week!"
  },
  {
    "date": "2024-02-20 11:29:10",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#BitcoinETFs saw record $2.4 billion weekly inflow last week!! #BullishAF \n\n@CoinDesk @CoinSharesCo \n\nhttps://t.co/c1VOJbI641"
  },
  {
    "date": "2024-02-19 16:26:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#NFT market is worth $10 billion today, derived from only 5% of NFTs that retained their value!\n\nRead more about what happened to NFTs since the start \nhttps://t.co/pOrWXflhwG\n\n#BlockchainInnovation #CryptoArt https://t.co/b6LWe0u2Dd"
  },
  {
    "date": "2024-02-16 16:21:27",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "According to Roland Berger, asset #tokenization  is current worth around $300 billion and will grow 40 times to be worth at least $10 trillion by 2030.\n\nAsset tokenization helps to remove geographical constraints and lessen financial constraints for assets that were illiquid. With #BlockchainTechnology  and its liquidity and fast transactions speed, ownership of a particular asset can now be fractionalized.\n\nBut what exactly is asset tokenization and how do we achieve that through Blockchain \u0026 #DigitalAssets ? Read more in this link:\nhttps://t.co/angtW2TKj3"
  },
  {
    "date": "2024-02-16 11:34:39",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "As bitcoin went back up to $52K yesterday for the first time in 2 years after #BitcoinETFs approval, Gold ETFs saw outflow of $2.39 billion so far.\n\nWith Bitcoin doing so well, critics warn of #DigitalAssets ' potential to destabilize real world currencies.\n\nHowever, U.S. Federal Reserve Gov. Waller challenges that idea, as he points out that most of DeFi trading uses stablecoins and since the market value of the #Dollar  s tied the stablecoins , the position of the dollar will simply strengthen instead.\n\nRead more on @CoinDesk : https://t.co/qSfucNMT0p"
  },
  {
    "date": "2024-02-15 17:25:45",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "According to @immunefi , $1.8 billion was lost to hacks and scams in 2023.\n\nHacks, exploits, scams and rug pulls are disastrous for traders in  #DigitalAssets , especially institutional traders. The need for secure and protected trades is even more dire now with the market on a bull run after #bitcoinetf.\n\nKnow-Your-Transaction (KYT) solutions help to protect your #assets  during trading. Read more on how KYT solutions came to be and how it secures your digital assets. \n\nhttps://t.co/pOLMDRX8Be"
  },
  {
    "date": "2024-02-14 11:52:52",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Pushing past $50K, Bitcoin hit a new high just yesterday. However, what does that mean for the rest of us who don't invest in Bitcoin?\n\n#BlockchainTechnology was meant to be a fully transparent ledger system, with the utility of #DigitalAssets being multi-faceted. Outside of #trading speculations, direct payment systems, asset tokenization and many other functions, can be implemented to transform the way we do business with each other.\n\nRead more about #BitcoinETFs could potentially be the event that changes our lives.  🔽\n\nhttps://t.co/1cvsk3r3Hy"
  },
  {
    "date": "2024-02-13 11:30:29",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "50K USD?! In the last one week, #Bitcoin  increased around 18%, finally breaking above $50,000 for the first time in more than 2 years.\n\nIn other news, Franklin Templeton joins the ETH ETF race as well. Is this the peak after a short pump in price? Or is this only just the beginning?\n\nRead more to find out whether you should be buying in now. ⬇\n\nhttps://t.co/aYrI0P4Eza\n\n#BitcoinETFs  #bitcoinnews  #DigitalAssets"
  },
  {
    "date": "2024-02-07 17:26:55",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "According to @KPMG 's recent report, fintech #investments drops to 5-year low while stablecoins, asset tokenization and blockchain payment solutions gained significant interest from regulators \u0026 financial institutions.\n\nHere are some learnings for the #Blockchain  and #DigitalAssets industry:\n\n1. Funding deal volume, for digital assets and blockchain, dropped by 50% in 2023 YoY.\n2. APAC region, especially Singapore and Japan, takes the lead on digital assets, with keen interest in supporting both technology #innovation and regulation.\n3. In 2024, KPMG analysts expect growing focus on #CBDCs  , stablecoins and institutional-grade blockchain solutions.\n4. With growing regulation clarity on digital assets, we can also expect increasing investments. \n\nIf your institution is looking for institutional-grade blockchain solutions, speak to our experts right now: \nhttps://t.co/KLXbd45oOp\n\nInformation and data source: KPMG Pulse of Fintech report: https://t.co/dMcZxTvWyA"
  },
  {
    "date": "2024-02-07 12:03:54",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Business activities is only enabled on the foundation of #trust .\n\nA protected #trading platform not only deters illegal activities, but institutional and retail traders alike can feel secure enough to #invest their money. A huge part of such security comes from having a good Know-Your-Transaction (KYT) and Know-Your-Customer (KYC) solution.\n\nIn the #DigitalAssets industry where assets are decentralized, KYT solutions play a much bigger role. Read more to find out how exactly KYT solutions protect your assets:\n\nhttps://t.co/JcYU9EXOH6"
  },
  {
    "date": "2024-02-06 15:57:44",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "ChainUp is now a Verified Operator on the SSV mainnet!\n\nNewly approved together with @blockshard1 @orionstaking @SpectrumStaking @StardustStaking and Hayhouse Projects, we had a high performance track record of running 10 validators on the SSV testnet with over 98% uptime. \n\nWe are now running validators on the mainnet and similarly, maintained 98% uptime since launch.\n \nGrateful to our partner @ssv_network for giving us a seal of approval!"
  },
  {
    "date": "2024-02-06 11:17:33",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "With a Beta of 1.31, #Bitcoin  is more volatile as compared to other #Asset classes. However, it provides the highest risk-adjusted returns as compared to other major asset classes.\n\nBitcoin investors are receiving a much higher rate of return for the risks they bear, demonstrating the potency of #DigitalAssets as an #investment vehicle.\n\nLooking to further diversify your portfolio with digital assets? Connect with us: \n\nhttps://t.co/GWqtapt1NS"
  },
  {
    "date": "2024-02-05 16:51:01",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "January saw the highest on-chain transaction #Volume for #Bitcoin  since 2022!\n\nWith the approval of #BitcoinETFs , Bitcoin has outshined silver ETFs to become second largest ETF commodity by Assets Under Management (AUM). However, prices remained relatively the same due to selling pressure, likely from @Grayscale Bitcoin Trust (GBTC).\n\nThe increase in popularity of Bitcoin ETFs, evident from the trade volume, signals a wider affirmation of BTC as an #investment vehicle."
  },
  {
    "date": "2024-02-02 15:40:45",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Built on Bitcoin blockchain, BRC-20 tokens peaked at 2.8 billion USD at its peak, signifying the market demand and consensus in the BRC-20 ecosystem.\n\nThrough the #Bitcoin ordinals protocol, the BRC-20 ecosystem encompasses a wide range of digital collectibles on Bitcoin chain.\n\nRead about why capability to support BRC-20 ecosystem is important to you and your clients.\n\nLink in comments ⬇\n\nhttps://t.co/UqYZQ6qk5X"
  },
  {
    "date": "2024-02-01 17:01:38",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "With growing interest from investors, Traditional Finance banks are also starting to offer #digitalassets custody services for their client.\n\nAccording to a study by NYDIG, 82% of investors want their #financial advisors to provide them with advice on #bitcoin . With a growing demand for investing in digital assets products, comes the demand for #custody solution with higher #security and technological capabilities.\n\nRead more to find out other reasons why your institution should join the ranks of banks who offer custody services.  ⬇\n\nhttps://t.co/qsNCf2gNzj"
  },
  {
    "date": "2024-02-01 11:49:31",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Know-Your-Customer (#KYC ) practices is common in banking industry but have you heard of Know-Your-Transaction (#KYT)?  \n\nKYC is foundation of a robust and trustworthy Traditional Finance banking system, deterring money laundering, financial crimes and identity theft. In #DigitalAssets , where #Decentralization and transparency of transactions is the name of the game, financial crime is monitored through KYT systems.  \n\nRead more to understand the difference between KYC and KYT.  ⬇\n\nhttps://t.co/SyjjrqWPnU"
  },
  {
    "date": "2024-01-31 15:11:17",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "What's the difference between third-party #DigitalAssets custody and self -custody? Which one should your institution go for?\n\nFull custody enhances #Assets management efficiency, minimizing management risks , and reducing operational costs; while in MPC wallet Custody, users retain control over their private keys, shared with the custodian, allowing complete asset control.\n\nRead more for detailed comparison between these two custody #solutions for your institution. Link in comments ⬇\n\nhttps://t.co/SHTQnPKThJ"
  },
  {
    "date": "2024-01-30 11:55:26",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "3 weeks since a dip in prices after #bitcoinetfapproval   , Bitcoin prices have went back up to $43,000 USD yesterday.\n\nWith BlackRock iShares #BitcoinETF  increasing number of Bitcoins held recently, bring their total #Assets Under Management (AUM) to $2 Billion, is this the start of the actual #Bullrun  ?\n\nRead more on how to start investing in Bitcoin ETFs and capitalize on the opportunity.  ⬇\n\nhttps://t.co/SvrrUzhdip"
  },
  {
    "date": "2024-01-29 18:12:31",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "🌟 We are thrilled to share the highlights from our recent event co-hosted with Blockchain Association Singapore (BAS) and @MarshMcLennan !\n\n🚀 Our expert panel offered deep insights into the world of #bitcoinetfs , shedding light on the future of #banking .\n\n🌐 From dissecting Bitcoin ETF implications for traditional banking to exploring innovative revenue streams, #portfoliodiversification, risk optimization, and wealth creation strategies, we all left with a clear roadmap for integrating Bitcoin ETFs into future banking offerings."
  },
  {
    "date": "2024-01-29 11:13:47",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "On top of enhanced security, Institutional level #DigitalAssets custody services also provides Anti Money Laundering (#AML ), Know Your Customer (#KYC ) and adherence to regulatory #compliance .\n\nEach feature is a building block of a secure and sound institutional custody solution, helping your clients to achieve their #business obejctive.\n\nFind out more about the different puzzle pieces that make up a good Custody system for your institution ⬇\n\nhttps://t.co/pw1sw30GEE"
  },
  {
    "date": "2024-01-25 16:28:08",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are hosting #bitcoinetf panel \u0026 networking session in both Hong Kong and Singapore!\n\nDoes your institution aspire to take the lead, embracing a forthcoming era of wealth creation?\n\nIf you are in Hong Kong or Singapore, join us and make the best of this #opportunity .\n\nSG Registration Link: \nhttps://t.co/IXPqTcpWEX\n\nHK Registration Link:\nhttps://t.co/z9SyLh3tOo\n\n@finoverse_ @MarshMcLennan"
  },
  {
    "date": "2024-01-25 12:02:26",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Unlock the full business potential of your business with custom developed #DigitalAssets  exchange! 💻\n\nTailored solutions ensure seamless alignment with your business needs, enhancing #functionality and design. In a dynamic market, #personalized  exchanges stand out, offering unmatched flexibility and innovation. \n\nRead more about the areas where you can customize your exchange software to maximize business potential. ⬇\n\nhttps://t.co/FobwdNkdru"
  },
  {
    "date": "2024-01-24 17:33:54",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "According to a report @PwC \u0026 @AspenDigitalAMP  , the digital asset custody market was valued at $447.9 billion in 2022.\n\n#digitalassets custody is particularly important for institutional investors, who often have significant digital assets and require professional custody services to ensure asset #security. With the rise in #business activities in digital assets space, demand of wallet services are bound to increase.\n\nClick here to read more about MPC wallets are critical to institutional investors.  ⬇\nhttps://t.co/ndS6elqRPK"
  },
  {
    "date": "2024-01-24 11:56:52",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Higher leverage, flexible #trading strategies, and lower slippage are main selling point of perpetual #futures trading in Decentralized Exchange.\n\nA contrasting feature to traditional futures, these innovations offer continuous, indefinite trading without the constraints of expiry dates.\n\nRead more to find out the benefits of building a Perpetual Futures #decentralized exchange. ⬇\nhttps://t.co/2rYyxcei1U"
  },
  {
    "date": "2024-01-23 12:14:53",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "User Management Features? #trading Features? User Interface Features? #Security Features? Wallet Features? Which of these are the most important features of a centralized exchange software?\n\nRead ChainUp's guide and explore the best #digitalassets exchange software and script features.  ⬇\nhttps://t.co/87Sr5N3wZZ"
  },
  {
    "date": "2024-01-22 11:38:21",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "\"Instead of a huge meteor, we should metaphorize the #capital injection from #BTCETF  as prolonged rainfall.\"\n\nTwo weeks has passed since Bitcoin ETF approvals, prices have been relatively the same. In addition to the slowdown in market #Momentum  , the BTC Spot ETFs introduced $818.9 million net inflow, lower than analyst forecast.\n\nRead more to find out what this slowdown mean for the #digitalassets industry.  ⬇\n\nRead more: https://t.co/ThCrkdwIai"
  },
  {
    "date": "2024-01-19 16:50:42",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Are you unhappy with some of the price #manipulation tactics, fictitious #trading volume, and other unethical practices when trading on centralized exchanges?\n\n#decentralized exchanges (DEXs) have revolutionized the way users trade and manage #DigitalAssets  . As peer-to-peer marketplaces, DEXs allow for direct digital assets transactions, bypassing traditional intermediaries like banks, brokers, and payment systems.\n\nRead more to find out the best Decentralized exchange on the market now. ⬇\nhttps://t.co/bwVAyDfgxF"
  },
  {
    "date": "2024-01-19 15:57:42",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#bitcoinetf approvals is one of the biggest news as we step into 2024. However, Digital Assets industry improves every day and in this ever-changing industry, information is key to win.\n\nRead ChainUp's 2023 #digitalassets Investor Memorandum as we bring you in through important events for 2023 and how these events shape outlook for 2024.⬇️\n\nhttps://t.co/SIl7I8mW2W\n\n#InvestmentInsights"
  },
  {
    "date": "2024-01-18 14:53:54",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "With numerous talks about how the newly approved ETFs can revolutionize #DigitalAssets  , what can we really stand to gain from the opportunity?\n\nTrue impact of #BitcoinETF  , excluding the most direct benefit of injection of #liquidity into the industry, lies with increasing recognition of digital assets by the wider public and investors.\n\nWhat are the opportunities, that the rest of the industry can ride on for this once in a lifetime event? Read more ⬇\nhttps://t.co/tElvdwGW0K"
  },
  {
    "date": "2024-01-17 15:32:54",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Generating over $500 million worth of #trading volume in a single day, top-used Decentralized Exchanges (DEX) like @dYdX , @Uniswap, @KineProtocol , create possibilities for generating high #profits  .\n\nHowever, business model of DEX is different from that of centralized exchanges. Other than collecting trading fees or platform fees, #decentralized exchange do not hold their users' assets, which means a different way of generating revenue.\n\nRead more about the different business models of a typical decentralized exchange.  ⬇\nhttps://t.co/yba24KjCBn"
  },
  {
    "date": "2024-01-16 14:27:54",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "🌐 We had the most incredible opportunity to participate in @SinohopeGroup  2023 Partners Conference: The Witness! 🌍\n\nThe conference was a hub of #insights into the latest industry #trends and innovations. Our CEO, Sailor Zhong shared about business strategies and insights about #DigitalAssets in 2024.\n\nConnecting with digitalassets industry leaders, visionaries, and forward-thinkers was a highlight of the event. A big shoutout to the incredible team who hosted the event as well as the attendees. 🚀"
  },
  {
    "date": "2024-01-12 17:57:26",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Bitcoin ETF is here. Is your institution ready to answer? Join ChainUp and Blockchain Association Singapore (BAS) to investigate the opportunities that Bitcoin ETF launch unlock.\n\nChainUp is hosting Bitcoin ETFs: Bridging the Gap Between TradFi and the Digital Age. \nMake sure to attend it on January 18. https://t.co/R2RvmRYiHk"
  },
  {
    "date": "2024-01-12 14:12:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Biggest milestone in the recent years for #digitalassets is #BitcoinETF  approval on Tuesday.\n\nThis event signifies that #bitcoin has passed it's initial trial as a medium of value.\n\nRead more to find out exactly how institutional investors are use digital assets in this new #investment vehicle.  ⬇\n\nRead more: https://t.co/fhRmMYp1eY\n\n#BitcoinEFT #ETHETF #Cryptocurency"
  },
  {
    "date": "2024-01-11 12:09:48",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "After a long anticipatory wait, @SECGov has finally approved 11 #BitcoinETF or trading in the U.S.\n\nAs ETFs are expected to begin #trading on Thursday, trading fees are slashed in #anticipation of the fierce competition for market share.\n\nFollow ChainUp to understand what this approval means for #tradfi and what you can do ⬇\n\nRead more: https://t.co/MsUPuOhQUd"
  },
  {
    "date": "2024-01-10 12:05:07",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "One of the market leaders \u0026 pioneers in #decentralized exchanges, @dYdX , commands a 24h #trading volume of roughly $1.3 billion.\n\nThe rapid #Growth and #market dominance of dYdX often sparks interest about what it takes to set up a successful exchange like them.\n\nFollow ChainUp as we dive into the cost breakdown of setting up a DEX ⬇\n\nRead more: https://t.co/U9dmsnMnR4"
  },
  {
    "date": "2024-01-09 17:06:29",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Relive the excitement of ChainUp webinar with @gate_hk CEO @Kevin_GateHK , where we delved into the captivating realm of #BlockchainTechnology and #CyberSecurity just three weeks ago. 🚀\n\nIn a thought provoking video snippet, Kevin challenged our perspectives on the actual practical adoption of #Blockchain beyond trading. 💡\n\nClick on the link in the comments to watch the full video ⬇\nhttps://t.co/uLA4YorcLZ"
  },
  {
    "date": "2024-01-09 11:34:50",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "✨ We had a blast hosting the Web3 meetup in Recife last week! 🌐\n\nGathering with global minds in #Web3  development, we celebrated progress, #Innovation  and of course, the coming of the new year. We were so grateful to have Insightful discussions with visionary leaders and trailblazing developers who have played a pivotal role in driving the Brazil #Blockchain industry forward.\n\nCheers to the brilliant minds shaping the decentralized future! 🎉🌍 #RECIFE  #BlockchainInnovation"
  },
  {
    "date": "2024-01-08 16:27:48",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "A barrier to entry into #Web3 , even before trading digital assets, is to research and create a secure wallet.\n\nCentralized exchanges typically holds your #DigitalAssets for you, but that has recently changed as #CEX start to offer Web3 wallet ecosystems.\n\nRead more about why Web3 wallets, hosting by centralized exchanges, are a safer and a more convenient option.  ⬇\n\nhttps://t.co/MwsfBekqFP"
  },
  {
    "date": "2024-01-05 11:08:03",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Importance of Know-Your-Transaction (#KYT) solutions extend beyond simply tracing and knowing about the flow of funds . Having a legitimate KYT solutions also means deterring criminal activities.\n\nRussian businesswoman Ekaterina Zhdanova, who was involved in moving over $100 million cross Russian borders for Russian elites, was also involved at laundering approximately $2.3 million for a group affiliated with ransomwares.\n\nFollow ChainUp as we trace how she attempts to launder money through #digitalassets. ⬇\n\nRead more: https://t.co/7caoyeCWz9"
  },
  {
    "date": "2024-01-04 16:48:34",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "According to @coingecko , 24h trading volume of @Uniswap is $1.48 billion.\n\nDecentralized Exchanges (DEX) offers high #security , high #transparency \u0026 low #transaction fees, making them increasingly popular and highly lucrative in the #fintech space.\n\nThis article will provide key steps and considerations to help you build a DEX. Link in comments ⬇\n\nRead more: https://t.co/wVjzcE1Pyz"
  },
  {
    "date": "2024-01-03 10:59:20",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "What allows you to trade with high #Efficiency , high #transparency , reduced risks and with almost no settlement time?\n\nDecentralized exchanges (DEX) are #blockchain -based platforms that enable direct peer-to-peer transactions. Through #smartcontracts on the blockchain, DEX offers an autonomous and secure trading environment.\n\nRead more about #decentralized , an alternate way of trading that is rapidly gaining popularity. Link in comments ⬇\n\nRead more:\nhttps://t.co/3cWtAMWeUI"
  },
  {
    "date": "2023-12-28 11:29:22",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Mid-sized digital asset exchanges in the US generate an average annual revenue of $10 million - $100 million, according to @FinmodelsLab.\n\nDigital asset exchanges remains to be one of the most #lucrative innovations in the #DigitalAssets space. Though intricate, steps to set up an exchange are forthright. Find out more about how to build a DAX.⬇\n\nhttps://t.co/M3c8fLxHS3"
  },
  {
    "date": "2023-12-27 17:00:37",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "According to @coingecko , the #GameFi market cap is $20.3 billion with a 24h #trading volume of $2.1 billion.\n\nUnsustainable play-to-earn models and low-quality gameplay issues plagued the industry in the past. Through continuous improvements \u0026 innovations, GameFi industry is looking to pick itself back up again, taking the gaming experience and #investors' returns to new heights.\n\nRead ChainUp Investment's #analysis and find out why you should pay attention to this lucrative ecosystem ⬇\n\nhttps://t.co/MdrGSAH6Nh"
  },
  {
    "date": "2023-12-26 15:06:13",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "📢We have entered into a strategic partnership with digital asset trading platform @BIKAGlobal_ . 📢\n\nAiming to provide superior market solutions, the collaboration will optimize #digitalasset  transactions \u0026 #FinancialSecurity. The construction of the #Inscriptions ecosystem is underway, with BIKA Global now supporting #BRC20. \n\nRead more:\nhttps://t.co/gjEJ0dX3JQ\n\nhttps://t.co/RD5LfN8Fyp"
  },
  {
    "date": "2023-12-26 11:55:08",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "In the largest freezing of stablecoins , @Tether_to  froze $225 million worth of USDT across 37 wallets in attempt to stop #Criminal  activities.\n\nSoutheast Asian #HumanTrafficking  syndicate responsible for \"Pig butchering\" scam was investigated by the U.S. Department of Justice. Scammers had victims to #invest their fortunes with the promises of love and wealth through flattery and fake bonding.\n\nFollow ChainUp as we trace addresses from the syndicate as they attempt to money launder through @okx  ⬇️\n\nhttps://t.co/KXgQD6EOCv"
  },
  {
    "date": "2023-12-22 22:34:13",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "🎉 We are delighted to announce a profound strategic collaboration with @BIKAGlobal_ !\n\n📷 ChainUp Custody has now enabled support for the deposit and withdrawal of #BRC20 ecosystem tokens. This move is aimed at assisting exchange clients in aggregating more BRC-20 ecosystem projects, capturing a greater user base, and enhancing the value of traffic. \n#Inscriptions #partnership #BRC20铭文"
  },
  {
    "date": "2023-12-22 10:43:29",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Accumulating proofs suggests Traditional Institutions are looking at #digitalassets as the next up-and-coming asset class.\n\nRead more to find out quickly how TradFi Institutions are innovating for #web3 industry.  ⬇\n\nRead more: https://t.co/58P4FihkNj https://t.co/1bGcZjHUhh"
  },
  {
    "date": "2023-12-21 16:13:16",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "ChainUp is hosting a offline panel discussion in Istanbul!\n\nDon't miss your chance to learn more about how #web3 technology, Centralized Exchanges and Decentralized Exchanges can help you in the coming #bullrun .\n\nCome and connect with our Turkish experts by signing up here:\nhttps://t.co/cBxuGWbgUP\n\nLocation: Halaskargazi St. No 38-66 , 34371 Şişli/İstanbul Workinton Lotus Nişantaşı 444 9 866\nDate: 22 December 2023\nTime: 1PM-5.30PM (GMT+3）"
  },
  {
    "date": "2023-12-21 11:36:26",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "\"As we look to the future, we see #stablecoins becoming further embedded into the fabric of #financial markets, acting as an important bridge between digital and real-world assets.\" said Lapo Guadagnuolo, Managing Director at @SPGlobalRatings .\n\nThe interest in #DigitalAssets from TradFi firms represents a vote of confidence and anticipatory attention from institutions.\n\nRead more: https://t.co/tCbCw9pWRe\n\nS\u0026P report: https://t.co/yEUS2jXlDg"
  },
  {
    "date": "2023-12-20 16:27:10",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "\"#bitcoin Spot ETF may be the biggest development on wall street in the last 30 years\" said @saylor  Saylor, CEO of @MicroStrategy \n\nThe approval represents the launch of several \"high bandwidth\" \u0026 #compliant channels for mainstream investors to invest in #digitalassets .\n\nDo you agree with Michael's point of view? Leave your comments ⬇\n\nRead more: https://t.co/V1jQZo9SJv"
  },
  {
    "date": "2023-12-20 11:47:15",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Making a deposit into centralized #exchanges in exchange for fiat #currency is one of the common ways to launder money.\n\nFollow ChainUp’s Trustformer as we use KYT to track fund sources from the Jihad organization and the destination of the transfer.  ⬇\nhttps://t.co/tMPVnnGW0H https://t.co/Xxgm0Gexwb"
  },
  {
    "date": "2023-12-19 17:29:00",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "🌐 We are thrilled to be a part of the #cuttingedge discussions and innovations shaping the future of #finance at the Web3 FutureFI 2023 Summit! 🌍\n\nWe are grateful for the opportunity to engage with #digitalassets industry leaders, visionaries, and forward-thinkers who are driving the next wave of financial #evolution and its limitless possibilities. 🚀\n\n@cyberport_hk @CentralResearc3 @News_Techub @hk01official"
  },
  {
    "date": "2023-12-18 17:48:19",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We had a fantastic time at our coffee meetup last week where we dived into discuss up-and-coming #trends2024 for the #indonesian #Crypto market! ☕️✨\n\nFrom discussing the latest #blockchain trends to sharing insights on upcoming projects \u0026 learning about their business leads, we also explored strategies to drive #innovation and #leadership in the Indonesian crypto scene. 📈\n\nIt was a night filled with inspiring conversations with leaders of the Indonesian market. Big shoutout to everyone who joined us! Let's keep building this incredible digital assets community and shaping the future of finance together. 🚀"
  },
  {
    "date": "2023-12-18 11:39:34",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "According to @trmlabs , despite malicious attacks remaining the same, the value of #digitalassets stolen fell by over 50% in 2023 vs 2022.\n\nImproved #Security measures and greater industry coordination helps to safeguard digital asset wallets and disarm breaches before they happen. One way to safeguard your digital assets is through storing your digital assets in your own wallets.\n\nClick the link in comments to read about the differences in the types of wallets that you can utilize ⬇\nhttps://t.co/KhTkzILJDS"
  },
  {
    "date": "2023-12-15 14:56:31",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "According to an article by The Times of Israel, it is estimated that Hamas #terrorist organization has raised around 41 million via #blockchaintechnology , bypassing banking restrictions.\n\nClick on the link in comments to learn how ChainUp's KYT solution can help to track #Cryptocurency  activities ⬇\n\nhttps://t.co/PACF0pp89h"
  },
  {
    "date": "2023-12-13 16:31:35",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Bitcoin's sudden flush on Monday has come to a standstill. However, is this really the end of it?\n\nOther than the remaining #ETF approvals from Blackrock \u0026 other fund management companies, other #institutions are also stepping into #DigitalAssets , with seemingly diversified institutional #investment  portfolios beyond conventional #Financial products.\n\nHow should we strategize our portfolio ? Read more in ChainUp's Market Opinion.  ⬇\nhttps://t.co/gVzGZANg3U"
  },
  {
    "date": "2023-12-12 15:53:00",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "According to @FMI_Research , the global decentralized social network market value is expected to rise from US$ 12,132.2 million in 2023 to US$ 101,200.8 million by 2033.\n\nWhile some censorship is appreciated, a common criticism of centralized #socialmedia is its #algorithm -only displaying information or advertisements based on current interests, viewpoints, keeping users contained in a solitary box of ideas.\n\nRead more about Decentralized Social Media and how it will solve these issues and emerge as the next major trend.  ⬇\n\nhttps://t.co/KREIeVKaKa"
  },
  {
    "date": "2023-12-08 11:22:43",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "RWA tokenization is #revolutionizing traditional asset trading, broadening #investment choices.\n\nAustralia, with a favorable #regulation environment for tokenization, is at the forefront of this movement.\n\nLearn what Australia has done to support Asset Tokenization ⬇\nhttps://t.co/krnzAz6sOd"
  },
  {
    "date": "2023-12-07 11:22:42",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "It is estimated that #bitcoin consumes more #energy than the whole of Norway in a year at 127 terawatt-hours.\n\nEnergy consumption of #emergingtechnologies , such as #digitalassets and generative #ai , rivaling energy consumption of a country. \n\nRead more about Sustainable Web3 in ChainUp Blog\nhttps://t.co/AEtYQcOENu"
  },
  {
    "date": "2023-12-06 15:58:33",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "RWA tokenization, is how #blockchaintechnology can effectively address long time challenges faced by traditional #finance, by mediating the transactions in a fast and #reliable way.\n\nLearn more about the evolving landscape of RWA tokenization:\nhttps://t.co/9KHIv6uyr4 https://t.co/pMHaJE17HX"
  },
  {
    "date": "2023-12-05 12:02:53",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "As of November 2023, Hong Kong accounts for more than 10% of the global #DigitalAssets trading volume, trailing only behind the United States.\n\nA substantial #supply \u0026 demand for digital asset solutions, together with favorable #regulatory environment and a mature #FinancialMarket with a robust #infrastructure and a rich talent pool, helps Hong Kong to see rapid #Growth in the digital assets sector.\n\nRead more about Hong Kong's digital assets industry in ChainUp Blog: https://t.co/41UqQmdl2A"
  },
  {
    "date": "2023-12-04 15:52:10",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Explore compelling scenarios for #tradfi's integration into the digital assets space and gather #valuableinsights on the evolving #landscape .\n\nDon't miss out on this insightful discussion, and register for our webinar right now. \n\nREGISTER HERE: https://t.co/oXC8MWNki8\n\nDate: 7th December 2023\nTime: 4PM - 5PM (GMT +8)\nLive on Zoom"
  },
  {
    "date": "2023-12-04 11:25:40",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Will $BTC surpass its former glory and hit $100,000 in 2024?!\n\n#Bitcoin   prices have broken the $40,000 mark on Sunday, in anticipation of the #ETF approval in the U.S., on top of bitcoin halving next year. With Bitcoin on a new bull run, most other top 10 #DigitalAssets , by market capitalization, have also made small #gains .\nAlthough Federal Reserve Chair Jerome Powell said that it was still too early to declare victory for #Inflation , his remarks also gave #confidence that the current rates are more than adequate to complete the job.\n\nDo you think Bitcoin will hit $100,000 as well?"
  },
  {
    "date": "2023-12-01 15:49:39",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "With the impending ETF approval from various #investment companies, is the #digitalassets winter ending soon?\n\nDiscover compelling use cases for #tradfi's entry into the digital assets realm and gain valuable insights into the future of this #dynamic market. Don't miss out on this insightful discussion- reserve your spot now!\n\nDate: 7th December 2023\nTime: 4PM - 5PM (GMT +8)\nLocation: Live on Zoom\n\nLink:\nhttps://t.co/oXC8MWNki8"
  },
  {
    "date": "2023-11-30 17:03:44",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Did you know an estimated 60,000 deaths per year are related to fentanyl overdose and you can track the financing of drug trafficking #onchain.\n\nChinese syndicates distributed #narcotics internationally and fostered an online #payment system through digital assets payment. Find out how ChainUp Trustformer KYT is able to track the financing of drug trafficking and help with #crimeanalysis ⬇\n\nhttps://t.co/YhECqLWcSA"
  },
  {
    "date": "2023-11-29 16:25:24",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "\"This transformation is supported by the government's backing, the establishment of #innovation centers, abundant #investment opportunities , the creation of compliant #regulations, and the promotion of project #collaborations.\"\n\nWith abundant opportunities, Dubai is rapidly developing to be one of the world's biggest #digitalassets hub. Dubai's ambition is to become the first government powered by #blockchain , with an eye on leading future #economic development.\n\nClick here to read more current Blockchain developments in Dubai ⬇\nhttps://t.co/JBK0NewJUC"
  },
  {
    "date": "2023-11-29 11:50:34",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Embark on a global blockchain exploration with ChainUp! 🌍 \n\nAfter the tremendous success of our 6th Orbit anniversary event, we're thrilled to announce a series of international stops for an unparalleled #blockchain  experience. \n\nFollow us at @ChainUpOfficial to get first-hand information at each destination to relive and connect with industry executives, while expanding your network. Seize the opportunity to learn, grow, and be part of our dynamic journey!"
  },
  {
    "date": "2023-11-27 17:34:33",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "What an incredible evening it was, at our recent #networking event in Bangkok, Thailand!\n\nOur team had the pleasure of connecting with brilliant minds from diverse background in the #Crypto space! We had the opportunity to learn from these experts about their #business needs and exchange views on recent news in the digital assets world.\n\nIt is so inspiring to see how #technology continues to bring people together, fostering #Collaboration and sparking new ideas.\n\nA big shoutout to everyone who joined us!"
  },
  {
    "date": "2023-11-24 16:48:10",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "In the midst of research #AML controls for Monetary Authority of Singapore (MAS) licensing, for #DigitalPayments token services?\n\nFollow ChainUp as we dissect MAS #AML guidelines:\nhttps://t.co/BVPLh9cD9m https://t.co/y731mmnSAH"
  },
  {
    "date": "2023-11-24 14:02:02",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Are we looking at the start of widespread #adoption of #blockchain solutions?\n\nWe are seeing use cases of Blockchain technology, outside of #cryptocurrency speculations, all over the world. Bank of Korea will launch a pilot program, in 2024, for 100,000 citizens to utilize CDBC to purchase goods. BOK envisions the government issued #token to solve problems in their current grant systems.\n\nRead more about BOK's project in the link in comments ⬇\nhttps://t.co/2mW23RqQlZ"
  },
  {
    "date": "2023-11-23 16:41:59",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Will #tradfi be the lead the way for the next #digitalassets bull run?\n\nJointly organized by ChainUp and SGTOX Digital Platform, the Asia-Pacific Real World Asset Tokenization Platform Executive Summit was held last week on the 17th Nov. Together with a short launch ceremony to announce the 17 founding member, the summit also featured #expert sharing sessions on the future of #RWA , history of #Blockchain, and regulation on RWA #Tokenization.\n\nClick on the link in comments to read more APRTP Executive Summit:\nhttps://t.co/KzNJPk64P9"
  },
  {
    "date": "2023-11-23 15:19:07",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Singapore is taking the world stage as a #crypto hub!\n\nWith ​​Richard Teng​ appointed the next CEO of @binance  as well as @cryptocom announcing establishment of Global Innovation Lab for Blockchain and Web3 in Singapore, Singapore fortifies her position as #DigitalAssets Hub of the world.\n\nClick here to read more about @_RichardTeng's appointment\nhttps://t.co/jcF5Trxkgr"
  },
  {
    "date": "2023-11-22 15:27:50",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "The market size for #tokenized assets is expected to reach $16 trillion by 2030. Will the next leg of bull run for #digitalassets be from Traditional Finance?\n\nClick on the link to read more about RWA Tokenization ⬇\nhttps://t.co/JyBtUmPyir https://t.co/4QALNNPcyj"
  },
  {
    "date": "2023-11-21 18:25:57",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "\"Co-building a global #blockchain ecosystem is about weaving connections with diverse entities, nurturing both #Innovation and enduring #Growth.\"\nsaid ChainUp CEO Sailor Zhong as he shared about application of #Blockchain technology in businesses at The SUSTAINABLE WEB3 SG 2023 jointly organized by the Singapore University of Social Sciences (@suss_sg ) Node for Inclusive Fintech (NiFT) and @WXblockchain."
  },
  {
    "date": "2023-11-21 18:25:50",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "\"Co-building a global #blockchain ecosystem is about weaving connections with diverse entities, nurturing both #Innovation and enduring #Growth.\"\nsaid ChainUp CEO Sailor Zhong as he shared about application of #Blockchain technology in businesses at The SUSTAINABLE WEB3 SG 2023 jointly organized by the Singapore University of Social Sciences (@suss_sg ) Node for Inclusive Fintech (NiFT) and @WXblockchain."
  },
  {
    "date": "2023-11-21 11:38:56",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "📢Announcement: ChainUp Custody has now integrated @Scroll_ZKP 📜 into our solutions!\n\n@Scroll_ZKP seamlessly extends ethereum's capabilities through #zkEVM tech, allowing hassle-free #dApp development with unlimited scalability.\n\nChainUp's award winning #custody solutions provides institutional-grade #security architecture and advanced #legal \u0026 #compliance controls, meeting your business objectives by driving #growth, #efficiency and #security."
  },
  {
    "date": "2023-11-20 17:40:17",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Join @ssv_network and ChainUp to learn more about the future of institutional #staking and how SSV enables such solutions to remain #decentralized and #robust!\n\nEvent date: 23rd November 1PM UTC on Twitter Live Steam"
  },
  {
    "date": "2023-11-17 16:32:10",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are here at the Asia-Pacific Real World Asset Tokenization Platform (@APRWATP ) Executive Summit!\n\nWe have learnt so much as we listened to insights shared by #RWA enablers who are paving the way for #strategic and #innovative #solutions in the  #blockchaintechnology.🚀\n\nJoin us if you are around the corner!😁"
  },
  {
    "date": "2023-11-16 17:05:39",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "The Asia-Pacific Real World Asset Tokenization Platform (AP®TP) Executive Summit is tomorrow!\n\nSee you there tomorrow! 😉 https://t.co/PkMebCifqv"
  },
  {
    "date": "2023-11-16 11:16:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are excited to announce our new partnership with APEX - Asia Pacific Exchange 新加坡亚太交易所! 🤝🏻\n\nIt brings us pride to be able help build up Blockchain #infrastructure and serve the #web3 community in its mission.\n\nRead more about this partnership here:\nhttps://t.co/So4CfM7Fi2"
  },
  {
    "date": "2023-11-15 17:20:03",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "2 days to sign up for Asia Pacific Real World Asset Tokenization Platform (@APRWATP ) Executive Summit!\n\nJoin our #expert sharing session and find out why #tokenized #RWA can potentially become a $10T market by 2030.\n\nSign up NOW⬇\nhttps://t.co/jha9n72PmT https://t.co/7clxZ8e97r"
  },
  {
    "date": "2023-11-14 13:04:53",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Tokenized RWAs Could Grow to a $10T Market by 2030 as #Crypto Converges to #TradFi\n\n#RWA #Tokenization is one of the best fundraising innovations that #Blockchain technology has to offer. Don't miss your chance to learn more about tokenization solutions at the Asia Pacific Real World Asset Tokenization Platform (AP®TP) Executive Summit this Friday, 17th November 2023 at Marina Bay Sands, Singapore!\n\nHear from ChainUp and key experts on unlocking the potential of real-world assets on blockchain networks and understanding the #technology and #ecosystem behind tokenization.\n\nClick here to sign up ⬇\nhttps://t.co/ckPwvnd7Ts"
  },
  {
    "date": "2023-11-09 12:20:29",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "How do you not only survive but stand out amidst the #Competition  in this #DigitalAssets winter? 🤔\n\nIt’s no #secret that you have to retain your #loyal  customers and acquire new users in the digital assets industry, but how do you perform in such a dynamic \u0026 fast-paced industry where major developments are rolled out every other day?\n\nClick on the link in the comments to read up on some of our expert guidelines on how to win against the crypto winter ⬇\n\nhttps://t.co/jzsdgoF36k"
  },
  {
    "date": "2023-11-08 11:19:02",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "6 years in industry having served over 1,000 #clients  and helped build 450 #DigitalAssets  exchanges, who else is more qualified to talk about what makes a superior digital assets exchanges? 😆\n\nThinking of setting up an exchange? Some telltale signs that would attract traders to trade on your platform: user-friendly interface, robust #security  protocol, high #liquidity and many more!\n\nRead more about signs of exceptional Digital Assets exchanges with ChainUp blog:\nhttps://t.co/gmExMUjZoe"
  },
  {
    "date": "2023-11-07 23:27:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Having a secure wallet is the foundation of trading in #DigitalAssets . Security is top most concern for retail and institutional traders alike.\n\nMulti-Party Computation (MPC) technology provides that layer of safety by splitting the keys into multiple shards and gives these shards to different parties for safekeeping. Hailed as one of the most potent transaction #encryption \u0026 #security technologies available today, MPC wallets protect your assets against potential breaches.\n\nClick on the link in the comments to read more about the power and promises of MPC wallets\n\nRead more about MPC wallets on ChainUp’s blog:\nhttps://t.co/WPL4JvxmKW"
  },
  {
    "date": "2023-11-07 14:33:22",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Looming spot #etfs approval, favorable macro conditions and demand for #tokenization , seems to point towards a boom in #DigitalAssets .\n\n“Traditional banks might not have much interest in Dogecoin or NFTs, but they love things like instant settlement (which you get with #RWAs), 24/7 #trading, lower costs, and the transformation of illiquid assets into liquid instruments.” quote from @CoinDesk article\n\nHow does your 2024 forecast for digital assets look like?\n\nRead more in this article:\nhttps://t.co/7G1UhdgQ9V"
  },
  {
    "date": "2023-11-06 11:10:28",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "We are excited to announce our new partnership with @zilliqa! As one of the #Pioneers  in #Blockchain  technology, it brings us pride to help build up Blockchain #infrastructure and serve the #Web3  community in its mission.\n\nFrom our CEO Sailor Zhong: “This alliance not only amplifies ChainUp's ongoing initiatives but also paves the way for innovative offerings and capabilities for our diverse clientele. This synergy marks a significant stride in cementing our footprints across sia, and we anticipate the monumental #Growth  and #opportunities this partnership is poised to bring.”\n\nClick here to read more about our partnership with Zilliqa:\nhttps://t.co/iPc1ML3mD8"
  },
  {
    "date": "2023-11-03 10:58:58",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "ChainUp is hounored to witness the launch of  @METAVERTU Dual-Model #AIphone !  \n\nBesides upgraded software and hardware, 2nd generation #web3phone #METAVERTU2 offers a new SE security chip, together with our triple system in one phone, giving the Metavertu2 top level security to host your wallet. The integrated #AI functions not only helps with daily life, but also follow the latest news providing real time analysis to self guard your portfolio.   \n\nChainUp is looking forward to collaborate with @vertu #METAVERTU, to become movers and shakers in #Web3  🚀\n\n#onemorebrain #AIphone #vertu"
  },
  {
    "date": "2023-11-02 17:38:32",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "🌟 Calling all #cryptocurrency influencers! 🌟\n\nAre you passionate about #DigitalAssets ? Want to join an exciting journey with our brand? We're on the lookout for Key Opinion Leaders (KOLs) to collaborate and share the love!\n\nIf you're ready to make a difference and be a part of something #Amazing , DM us  to learn more. 💫 \n#JoinUs"
  },
  {
    "date": "2023-11-02 16:27:58",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Are you attending #HongKongFinTechWeek2023  too? What a coincidence, we are there too!😉\n\nCome and talk to us now and find out how #Blockchain  can be integrated with #fintech. No matter if you are a startup looking to streamline #operations or enterprise seeking to revolutionize your industry, ChainUp can help your company achieve #Growth , #Efficiency , and #Security .\n\nWe are located at Hall 3, Booth Number FB07!"
  },
  {
    "date": "2023-11-01 14:16:23",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "🚀Must-Read Crypto Insights! 📈 \n\nIs the $BTC #bullrun already underway? Increasing age of $BTC holdings in anticipation of ETF launch, diminishing exchange supply, and upcoming catalysts hint at a supply shock.\n\nClick here to read #Crypto opinion piece by ChainUp experts: https://t.co/nVbVlh57RD"
  },
  {
    "date": "2023-10-31 10:10:50",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Looking for an amazing yacht party where you can connect with like-minded industry leaders? Join us at  @Cointime_global 's Investor's Night, @Timestampsummit,  9th Nov in Istanbul!\n\nPsst... hint hint we are there as co-hosts, come talk to us! 😉\n\nRegister here:\nhttps://t.co/fp8gdTsMVh"
  },
  {
    "date": "2023-10-30 15:31:40",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "What’s the difference between traditional #DigitalAssets wallet and #MPC wallets?\n\nIn the advent of #Web3 , we are faced with different challenges and an increased need to develop better underlying infrastructure. Digital assets wallets are often the targets of malicious attacks. A second generation of Wallets, more secure and user-friendly #decentralized  wallet solutions was soon developed.\n\nWant to read more? Read more about Wallet 2.0 in this article, “The Digital Assets Wallet Revolution”:\nhttps://t.co/gIARn2DBE6"
  },
  {
    "date": "2023-10-26 17:19:28",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "This is a must attend webinar if your company deal with #digitalassets!\n\nJoin us in ChainUp's webinar: “Protecting Profits and Reputation: AML Essentials for Businesses” where we discuss how can you can set up a good AML process and what to look out for in KYT softwares\n\nDate: 31st October 2023\nTime: 4PM-5PM (GMT+8)\n\n​​Don't miss this exceptional opportunity to gain a profound understanding of AML \u0026 KYT operations in the blockchain space.\n\nRegister NOW:\nhttps://t.co/EWByX7eEjg"
  },
  {
    "date": "2023-10-25 13:34:09",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "How can you tell your AML is good enough to detect money laundering activities? \n\nJoin us in our very own #webinar \"Protecting Profits and Reputation: AML Essentials for Businesses\"\n\nDate: 31st October 2023\nTime: 4PM-5PM (GMT+8)\nWho should attend: ​Entrepreneurs, CEOs, CTOs, COOs, business leaders, directors and managers who work in the Digital Assets space.\n\n​​Don't miss this exceptional opportunity to gain a profound understanding of AML \u0026 KYT operations in the #blockchain  space.\n\nRegister NOW:\nhttps://t.co/EWByX7eEjg"
  },
  {
    "date": "2023-10-24 11:54:18",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "35k USD?! Will Bitcoin continue to go up? 🤑🤑\n\nBitcoin prices were on the rise early this morning as @BlackRock #ETF  was listed on the website of Deposit Trust \u0026amp; Clearing Corp. Though not yet approved, this signals huge confidence in the upcoming  BlackRock $BTC ETF. https://t.co/svO8FuOIAF"
  },
  {
    "date": "2023-10-13 17:30:51",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Wanna meet Crypto Executives in Dubai? 😆\n\n#2daysleft #GITEX #Dubai https://t.co/Llh3z431Jr"
  },
  {
    "date": "2023-10-12 15:28:31",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "3 DAYS LEFT!\n\nAre you really going to miss out on the opportunity to share exciting new projects that you are working on and connect with other industry experts? Join us in this exciting evening at Armani Hotel under Burj Khalifa.\n\nSign up here NOW:\nhttps://t.co/frBFOUVH0W https://t.co/ACead1c8Jf"
  },
  {
    "date": "2023-10-03 15:35:25",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Has the extension in the US government shutdown been a relief for your organization as well?\n\nUS President Joe Biden has signed a 45 days extension to keep the government open, ensuring the September economic data release to be on time."
  },
  {
    "date": "2023-10-02 18:08:27",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "“Yields from investing an individual’s pension plans are chipped away by the middlemen such as fund managers. That’s where blockchain is great because it cuts off a lot of that.”\n\nWhile problems such as frauds and poor management plagues the blockchain world, this phase will soon pass as more regulatory bodies and major stakeholders enter the game. Major financial institutions such as Citigroup and Blackrock are gearing up to enter into the Web3.0 industry. Tokenization solutions offer opportunities to invest in real, physical assets, while payment solutions through wallets offer 24/7 direct payment to your vendors/ suppliers.\n\nIs your organization looking to employ Blockchain solutions but don’t know where to start? Connect with us: https://t.co/R8Bo6BOZuE\n\nRead more:\nhttps://t.co/Xd63cloj2D"
  },
  {
    "date": "2023-09-28 17:53:20",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "“It’s the future, that’s what I believe in. #AI , #fintech , they’re going to change the world. And it’s going to change the way people run their #Businesses ,” says Pontiac Land Group Chairman, Kwee Liong Tek. \nChairman Kwee, amongst the top 10 richest in Singapore, as well as one of #ChainUp’s key investor, has affirmed his confidence in recent technological developments and how it will bring changes about our current way of working.\n\nAs the traditional finance industry makes a move into #digitalassets, as well as rapid developments in #AI, #Web3, revolutionizing changes are transforming the way businesses work. As a #blockchain  #SaaS  company, we are excited to be part of the community bringing about these #nextgen tech changes with our client-focused #blockchain solutions.\n\nRead more: https://t.co/4Kf1jcjOxY"
  },
  {
    "date": "2023-09-26 17:51:10",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "How has the September rate pause by #FOMC affected your business functions? 💹\n\n11 rate hikes in, inflation rate and economic activities remain high. FOMC, together with some  European Central Banks, have opted to pause the rate hikes. US bond yield increased to cycle high, 10 year yield at 4.436%.\n\nAt an interview with @timesofindia, Jamie Daimon expresses his uncertainty over additional rate hikes. As additional hikes loom, dreams of soft landing grow further from reality.\n\nRead more in our weekly ChainUp Investment’s market review\nCLICK HERE: https://t.co/lnuR6s8SO4\n\n#news #FOMC"
  },
  {
    "date": "2023-09-25 16:02:11",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Looking to offer your clients a #payment solution that vastly reduces payment time? #blockchain  technology offers automated #trade payment solutions all around the clock, helping clients in time sensitive industries to make prompt payments.\n\n@Citi group has launched a pilot service to allow @MaerskTankers to make payments to canal authority via smart contracts, reducing gaps time taken in service windows.\n\nTalk to us to learn more about #Tokenization  solutions:\nhttps://t.co/xP4Itu3psr\n\nLink: https://t.co/PMFoscymBi"
  },
  {
    "date": "2023-09-22 17:27:12",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Customer-centric innovation is something we excel at ChainUp, click on this link now to learn more about us:\nhttps://t.co/NBhvnln17E\n\n@get_revuto @v_vukman @Cardano_CF @russyote\n#Cardano #digitalassets #custody #wallet #ChainUpCustody"
  },
  {
    "date": "2023-09-21 15:02:45",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Hey @coinexcom, heard you are looking to deploy a new wallet system, maybe we can help? 🙂\n\nLink: https://t.co/Nbm4GxFYWk"
  },
  {
    "date": "2023-09-21 11:43:03",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#digitalassets market dip as #FOMC kept interest rates up and seemingly implied that rate cuts will come only much later than the market expects. Do you think this move is necessary?"
  },
  {
    "date": "2023-09-20 18:23:50",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Fraud cases in the #digitalassets community paints a bad name.\n\nHong Kong police has launched an official #fraud investigation into an unlicensed Centralised Exchange (#CEX) called #JPEX. #SFC has informed the public that over 1,000 complaints were filed against JPEX and claims of losses amounting to over 1B HKD ($128 M).\n\nHow can we better inform consumers to make better decisions with the various exchanges to better protect their interests and build up a legitimate trading community? Speak to our experts to find out now:\nhttps://t.co/xP4Itu3psr\n\nLink: https://t.co/KKTHphpmAD"
  },
  {
    "date": "2023-09-19 16:19:17",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "Do you support traditional asset management firms joining the spot #BTC #ETF race? 💹\n\nClick here to read ChainUp Investment’s weekly market review: \nhttps://t.co/As9rx5QyOL\n\n1. A display of faith in #DigitalAssets bitcoin? Trillion dollar asset manager @FTI_US Franklin Templeton joins the queue for a spot bitcoin ETF.\n\n2. #Token2049 top discussions: #RWA #ZKL2 #LSD. @0xPolygonLabs invests $1 billion on zero-knowledge proof-powered solutions.\n\n3. Good news? Token sales will not flood the market as #FTX , had been approved by court, to start a paced liquidation process of its $3.4B #DigitalAssets, but creditors think otherwise.\n\n4. #CoinEx has lost 70 million worth of Digital Assets in a hacking incident and promised to reimburse affected users.\n\n#news #digitalassets #sol"
  },
  {
    "date": "2023-09-15 18:15:36",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "#ChainUp's KYT subsidiary Trustformer has collaborated with @NTUsg Nanyang Technological University Singapore to utilize AI in Anti-Money Laundering (#AML) efforts, with funding and support from the Cyber Security Agency of Singapore (#CSA).\n\nThis initiative highlights #Chainup \u0026 #NTU's dedication to advancing blockchain #security standards and foster a safer and more reliable trading environment for the global #DigitalAssets community.\n\nClick here to read about ChainUp's partnership with NTU: https://t.co/cNeV67oo9H"
  },
  {
    "date": "2023-09-14 20:06:42",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "RT @ssv_network: 3 hours until our Mainnet Call goes live! 👀\n\nWe will be revealing the grand Launch phase, discuss improvements made, netwo…"
  },
  {
    "date": "2023-09-13 16:44:52",
    "source": "Sourced from chainup's Twitter.",
    "Twitter": "🌐 ChainUp is thrilled to be at @Token2049, Asia's premier crypto event! 🚀\n#Visit us at Stand P101 on Level 4 of Marina Bay Sands Expo and Convention Centre.\nDiscover the latest blockchain innovations and meet our team. See you there! 🌟\n\n#ChainUp #Token2049 #BlockchainInnovation"
  }
]
